NeoTeploUNF.АдаптацияНеоТепло/src/DataProcessors/АНТ_ПереходНаВерсию_1_0_3/АНТ_ПереходНаВерсию_1_0_3.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АНТ_ПереходНаВерсию_1_0_3</name>
</mdclass:DataProcessor>

NeoTeploUNF.АдаптацияНеоТепло/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РасходнаяНакладная</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВидЦен</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.ВидыОперацийРасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭлектронногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.ВидыЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварноТранспортнаяНакладнаяЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.ТТНИсходящаяЕГАИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>УдалитьАНТ_ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьАНТ_Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СправкаБ</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СправкиБЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьАНТ_ЦенаПоТипу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>А_ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>А_Коэффициент</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>А_ЦенаПоТипу</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкидкиНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>Предоплата</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Документ</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

NeoTeploUNF.АдаптацияНеоТепло/src/DataProcessors/АНТ_ПереходНаВерсию_1_0_3/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ВыполнитьПереход1(Команда)
	ВыполнитьПереходНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьПереходНаСервере()
	
	//Перенос данных с реквизитов расширений в реквизиты конфигурации. Глюки при обновлениях.
	
	//РасходнаяНакладная
	//ТЧ.Запасы: УдалитьАНТ_ВидЦены, УдалитьАНТ_Коэффициент, УдалитьАНТ_ЦенаПоТипу 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ЗаписатьЗаказПокупателя = Ложь;
		
		Для каждого сТЧ Из ДокОбъект.Запасы Цикл
			Если ЗначениеЗаполнено(сТЧ.УдалитьАНТ_ВидЦены) Тогда
				сТЧ.А_ВидЦены = сТЧ.УдалитьАНТ_ВидЦены;
				ЗаписатьЗаказПокупателя = Истина;
			КонецЕсли;	
			Если ЗначениеЗаполнено(сТЧ.УдалитьАНТ_Коэффициент) Тогда
				сТЧ.А_Коэффициент = сТЧ.УдалитьАНТ_Коэффициент;
				ЗаписатьЗаказПокупателя = Истина;
			КонецЕсли;
			Если ЗначениеЗаполнено(сТЧ.УдалитьАНТ_ЦенаПоТипу) Тогда
				сТЧ.А_ЦенаПоТипу = сТЧ.УдалитьАНТ_ЦенаПоТипу;
				ЗаписатьЗаказПокупателя = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗаписатьЗаказПокупателя = Истина Тогда
		Попытка
			ДокОбъект.Записать();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Записан документ " + ДокОбъект;
			Сообщение.Сообщить();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
	КонецЦикла;
	
	//ЗаказПокупателя 
	//УдалитьАНТ_Тип, УдалитьАНТ_ПлощадьДома, УдалитьАНТ_Мощность, УдалитьАНТ_Оборудование_Солнечные
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ЗаписатьЗаказПокупателя = Ложь;
		
		Если ЗначениеЗаполнено(ДокОбъект.УдалитьАНТ_Тип) Тогда
			ДокОбъект.А_Тип = ДокОбъект.УдалитьАНТ_Тип;
			ЗаписатьЗаказПокупателя = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокОбъект.УдалитьАНТ_ПлощадьДома) Тогда
			ДокОбъект.А_ПлощадьДома = ДокОбъект.УдалитьАНТ_ПлощадьДома;
			ЗаписатьЗаказПокупателя = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокОбъект.УдалитьАНТ_Мощность) Тогда
			ДокОбъект.А_Мощность = ДокОбъект.УдалитьАНТ_Мощность;
			ЗаписатьЗаказПокупателя = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокОбъект.УдалитьАНТ_Оборудование_Солнечные) Тогда
			ДокОбъект.А_Оборудование_Солнечные = ДокОбъект.УдалитьАНТ_Оборудование_Солнечные;
			ЗаписатьЗаказПокупателя = Истина;
		КонецЕсли;
		
	//ТЧ.Запасы: УдалитьАНТ_ГруппаИД
	Для каждого сТЧ Из ДокОбъект.Запасы Цикл
		Если ЗначениеЗаполнено(сТЧ.УдалитьАНТ_ГруппаИД) Тогда
			сТЧ.А_ГруппаИД = сТЧ.УдалитьАНТ_ГруппаИД;
			ЗаписатьЗаказПокупателя = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	//ТЧ.УдалитьАНТ_РазделыГруппы: РазделГруппа, РазделГруппаИД
	Для каждого сТЧ Из ДокОбъект.УдалитьАНТ_РазделыГруппы Цикл
		Если ЗначениеЗаполнено(сТЧ.РазделГруппа) Тогда
			сТЧДок = ДокОбъект.А_РазделыГруппы.Добавить();
			сТЧДок.РазделГруппа = сТЧ.РазделГруппа;
			сТЧДок.РазделГруппаИД = сТЧ.РазделГруппаИД;
			ЗаписатьЗаказПокупателя = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	Если ЗаписатьЗаказПокупателя = Истина Тогда
		Попытка
			ДокОбъект.Записать();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Записан документ " + ДокОбъект;
			Сообщение.Сообщить();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
КонецЦикла;	
		
	//СчетНаОплату
	//УдалитьАНТ_ЗаказПокупателя
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетНаОплату.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетНаОплату КАК СчетНаОплату";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если ЗначениеЗаполнено(ДокОбъект.УдалитьАНТ_ЗаказПокупателя) Тогда
			ДокОбъект.А_ЗаказПокупателя = ДокОбъект.УдалитьАНТ_ЗаказПокупателя;
			Попытка
				ДокОбъект.Записать();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Записан документ " + ДокОбъект + " со значением А_ЗаказПокупателя: " + ДокОбъект.А_ЗаказПокупателя;
				Сообщение.Сообщить();
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	//СчетНаОплатуПоставщика
	//УдалитьАНТ_ЗаказПоставщику
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетНаОплатуПоставщика.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если ЗначениеЗаполнено(ДокОбъект.УдалитьАНТ_ЗаказПоставщику) Тогда
			ДокОбъект.А_ЗаказПоставщику = ДокОбъект.УдалитьАНТ_ЗаказПоставщику;
			Попытка
				ДокОбъект.Записать();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Записан документ " + ДокОбъект + " со значением А_ЗаказПоставщику: " + ДокОбъект.А_ЗаказПоставщику;
				Сообщение.Сообщить();
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	
	//СдельныйНаряд
	//УдалитьАНТ_ЗаказПокупателя
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СдельныйНаряд.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СдельныйНаряд КАК СдельныйНаряд";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если ЗначениеЗаполнено(ДокОбъект.УдалитьАНТ_ЗаказПокупателя) Тогда
			ДокОбъект.А_ЗаказПокупателя = ДокОбъект.УдалитьАНТ_ЗаказПокупателя;
			Попытка
				ДокОбъект.Записать();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Записан документ " + ДокОбъект + " со значением А_ЗаказПокупателя: " + ДокОбъект.А_ЗаказПокупателя;
				Сообщение.Сообщить();
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
